Examinator/src/Catalogs/ФайлыСУЗ/ФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФайлыСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>FlashВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FlashЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выравнивать</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьПоСсылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьВнешнимПриложением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайла</name>
    <type>
      <types>EnumRef.ТипыФайловСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроигрыватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуМодально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуБезопасно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокумента</name>
    <type>
      <types>CatalogRef.ШаблоныДокументовСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ДанныеФайлыСУЗ/ДанныеФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеФайлыСУЗ</name>
  <resources>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/ФайлыСУЗ/Forms/ФормаКонвертерВидео/Module.bsl
&НаКлиенте
Перем ТипПлатформыНаКлиенте;

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Формируем данные
	
	СформироватьТаблицуФорматов();	
	
	// Устанавливаем видимость элементов формы
	
	Если ЗначениеЗаполнено(Параметры.Файл) Тогда
		
		Элементы.ГруппаТаблицаФайлов.Видимость = Ложь;
		Элементы.ГруппаКомандыКонвертации.Видимость = Ложь;		
		Элементы.ГруппаФорматыФайла.Видимость = Истина;
		
		Элементы.ДекорацияФорматыФайлаЗаголовок.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.ДекорацияФорматыФайлаЗаголовок.Заголовок, Параметры.Файл);
		
		Элементы.ЗаданияФайл.Видимость = Ложь;
		
	Иначе
		
		Элементы.ГруппаТаблицаФайлов.Видимость = Истина;
		Элементы.ГруппаКомандыКонвертации.Видимость = Истина;
		Элементы.ГруппаФорматыФайла.Видимость = Ложь;
		
		Элементы.ЗаданияФайл.Видимость = Истина;
		
	КонецЕсли;	
		
	УстановитьДоступностьЭлементовФормы();
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СистемнаяИнформация = Новый СистемнаяИнформация();

	ТипПлатформыНаКлиенте = СистемнаяИнформация.ТипПлатформы;
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента();
	
	Если (ТипПлатформыНаКлиенте = ТипПлатформы.Windows_x86) ИЛИ (ТипПлатформыНаКлиенте = ТипПлатформы.Windows_x86_64) И ПараметрыРаботыКлиента.ИнформационнаяБазаФайловая Тогда
		Элементы.РежимОтладки.Видимость = Истина;
	Иначе
		Элементы.РежимОтладки.Видимость = Ложь;
	КонецЕсли;	
	
	
	#Если ВебКлиент Тогда			
		
	Элементы.ГруппаКомандыКонвертации.Видимость = Ложь;
	Элементы.ГруппаЗадания.Видимость = Ложь;
	
	Элементы.СформироватьFLV.Доступность = Ложь;
	Элементы.СформироватьMP4.Доступность = Ложь;
	Элементы.СформироватьWEBM.Доступность = Ложь;
	
	#КонецЕсли
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОтменитьПроцессКонвертации();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненаКонвертацияВидео" И Источник <> ЭтотОбъект Тогда
		СформироватьТаблицуФорматов();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СформироватьЗаданияFLV(Команда)
	СформироватьЗадания("FLV");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаданияMP4(Команда)
	СформироватьЗадания("MP4");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаданияWEBM(Команда)
	СформироватьЗадания("WEBM");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗадания(Формат=Неопределено, ВыделенныеСтроки = Неопределено)
	
	Если ВыделенныеСтроки = Неопределено Тогда	
		ВыделенныеСтроки = Элементы.ТаблицаФайлов.ВыделенныеСтроки;
	КонецЕсли;
	
	Если Формат = Неопределено Тогда
		Формат = "MP4"
	КонецЕсли;
	
	ФайлыДляКонвертации = Новый Массив;
	
	Для каждого ИдентификаторСроки Из ВыделенныеСтроки Цикл
		
		Если ТипЗнч(ИдентификаторСроки) = Тип("Число") Тогда
			ТекущаяСтрока = ТаблицаФайлов.НайтиПоИдентификатору(ИдентификаторСроки);		
		Иначе
			ТекущаяСтрока = ИдентификаторСроки;
		КонецЕсли;
		
		ФайлыДляКонвертации.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Файл, Версия, Поставщик, ИмяФайла, БазовыйФормат", ТекущаяСтрока.Файл, ТекущаяСтрока.Версия, ТекущаяСтрока.Поставщик, ТекущаяСтрока.ИмяФайла, ТекущаяСтрока.БазовыйФормат)));
		
	КонецЦикла;
	
	Если ФайлыДляКонвертации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКонвертации = Новый Структура("Формат, Файлы", Формат, Новый ФиксированныйМассив(ФайлыДляКонвертации));
	
	ОписаниеОповещенияВыбора = Новый ОписаниеОповещения("СформироватьЗаданияПродолжение", ЭтотОбъект, ДанныеКонвертации);
	ОткрытьФорму("Справочник.ФайлыСУЗ.Форма.ФормаВыбораНастроекКонвертации", , ЭтотОбъект,,,,ОписаниеОповещенияВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаданиеНаКонвертациюОдногоФайла(Формат)
	
	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	СвойстваФайла = ТаблицаФайлов[0];
	
	ФайлыДляКонвертации = Новый Массив();	
	ФайлыДляКонвертации.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Файл, Версия, Поставщик, ИмяФайла, БазовыйФормат", СвойстваФайла.Файл, СвойстваФайла.Версия, СвойстваФайла.Поставщик, СвойстваФайла.ИмяФайла, СвойстваФайла.БазовыйФормат)));	
		
	ДанныеКонвертации = Новый Структура("Формат, Файлы", Формат, Новый ФиксированныйМассив(ФайлыДляКонвертации));
	
	ОписаниеОповещенияВыбора = Новый ОписаниеОповещения("СформироватьЗаданияПродолжение", ЭтотОбъект, ДанныеКонвертации);
	ОткрытьФорму("Справочник.ФайлыСУЗ.Форма.ФормаВыбораНастроекКонвертации", , ЭтотОбъект,,,,ОписаниеОповещенияВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаданияПродолжение(ВыбранныеНастройки, ДанныеКонвертации) Экспорт
	
	Если ВыбранныеНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	// Заполняем таблицу заданий	
	
	Формат = ДанныеКонвертации.Формат;
	ФайлыДляКонвертации = ДанныеКонвертации.Файлы;
	
	НомерЗадания = 0;
	
	Для каждого СвойстваФайла Из ФайлыДляКонвертации Цикл	
			
		// Ищем существующее задание
		
		НайденныеСтроки = Задания.НайтиСтроки(Новый Структура("Файл, Формат", СвойстваФайла.Файл, Формат));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Продолжить; // Уже есть задание
		КонецЕсли;		
		
		// Добавляем новое задание
		
		НомерЗадания = НомерЗадания + 1;
		
		НоваяСтрока = Задания.Добавить();	
		НоваяСтрока.Файл = СвойстваФайла.Файл;
		НоваяСтрока.ИмяФайла = СвойстваФайла.ИмяФайла;
		НоваяСтрока.Поставщик = СвойстваФайла.Поставщик;
		НоваяСтрока.Версия = СвойстваФайла.Версия;				
		НоваяСтрока.Формат = Формат;
		НоваяСтрока.Номер = НомерЗадания;
		НоваяСтрока.Картинка = 3;
		НоваяСтрока.БазовыйФормат = СвойстваФайла.БазовыйФормат;		
		НоваяСтрока.Настройки = ВыбранныеНастройки;
	
	КонецЦикла;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьКонвертацию(Команда)			
	ВыполняетсяКонвертация = Истина;
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗадания(Команда)
	
	ВыделенныеСтроки = Элементы.Задания.ВыделенныеСтроки;
	
	Для каждого ИдентификаторСроки Из ВыделенныеСтроки Цикл
		ТекущаяСтрока = Задания.НайтиПоИдентификатору(ИдентификаторСроки);
		Если ТекущаяСтрока.Выполняется Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Задание выполняется и не может быть удалено. Отмените процесс конвертации'"));
		Иначе
			Задания.Удалить(ТекущаяСтрока);
		КонецЕсли;
			
	КонецЦикла;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФорматы(Команда)
	
	ВыделенныеСтроки = Элементы.ТаблицаФайлов.ВыделенныеСтроки;
	ВыбранныеФайлы = Новый Массив;
	
	Для каждого ИдентификаторСроки Из ВыделенныеСтроки Цикл	
		ТекущаяСтрока = ТаблицаФайлов.НайтиПоИдентификатору(ИдентификаторСроки);		
		ВыбранныеФайлы.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Файл, Версия, Поставщик", ТекущаяСтрока.Файл, ТекущаяСтрока.Версия, ТекущаяСтрока.Поставщик)));
	КонецЦикла;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьФорматыПродолжение(РазработкаСУЗКлиентСервер.ДоступныеФорматыВидео(), ВыбранныеФайлы);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФормат(Формат)

	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	СвойстваФайла = ТаблицаФайлов[0];
	
	ВыбранныеФайлы = Новый Массив();	
	ВыбранныеФайлы.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Файл, Версия, Поставщик", СвойстваФайла.Файл, СвойстваФайла.Версия, СвойстваФайла.Поставщик)));
	
	МассивФорматов = Новый Массив;
	МассивФорматов.Добавить(Формат);
	
	УдалитьФорматыПродолжение(Новый ФиксированныйМассив(МассивФорматов), ВыбранныеФайлы);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФорматыПродолжение(Форматы, ВыбранныеФайлы) Экспорт	
	
	Если Форматы <> Неопределено И Форматы.Количество() > 0 Тогда
		УдалитьФорматыНаСервере(Форматы, ВыбранныеФайлы);
	КонецЕсли;
	
	Оповестить("ВыполненаКонвертацияВидео", Параметры.Файл, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьФорматыНаСервере(Знач ВыбранныеФорматы, Знач ВыбранныеФайлы)
	
	Для каждого СвойстваФайла Из ВыбранныеФайлы Цикл
	
		Для каждого Формат Из ВыбранныеФорматы Цикл
			
			РазработкаСУЗ.УдалитьДанныеВерсииОбъектаСУЗ(СвойстваФайла.Файл, Формат, СвойстваФайла.Поставщик, СвойстваФайла.Версия);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения(); // Так как доступные форматы кэшируются
	
	СформироватьТаблицуФорматов();
	
	УстановитьДоступностьЭлементовФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьКонвертацию(Команда)
	ОтменитьПроцессКонвертации();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ТекущаяСтрока = ТаблицаФайлов.НайтиПоИдентификатору(Элементы.ТаблицаФайлов.ТекущаяСтрока);		
	
	ПоказатьЗначение(, ТекущаяСтрока.Файл);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьФайл(Команда)
	
	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ТекущаяСтрока = ТаблицаФайлов.НайтиПоИдентификатору(Элементы.ТаблицаФайлов.ТекущаяСтрока);		
	
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(, ТекущаяСтрока.Файл, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФайлы(Команда)
	СформироватьТаблицуФорматов();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьFLV(Команда)
	СформироватьЗаданиеНаКонвертациюОдногоФайла("FLV");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьMP4(Команда)
	СформироватьЗаданиеНаКонвертациюОдногоФайла("MP4");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьWEBM(Команда)
	СформироватьЗаданиеНаКонвертациюОдногоФайла("WEBM");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьFLV(Команда)
	УдалитьФормат("FLV");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьMP4(Команда)
	УдалитьФормат("MP4");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьWEBM(Команда)
	УдалитьФормат("WEBM");
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕСС КОНВЕРТАЦИИ

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеКонвертации()  
	
	#Если НЕ ВебКлиент Тогда
		
	Если НЕ ВыполняетсяКонвертация Тогда
		Возврат;
	КонецЕсли;
		
	// Ищем задания для запуска
	
	НайденныеСтроки = Задания.НайтиСтроки(Новый Структура("Выполняется", Истина));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		НайденныеСтроки = Задания.НайтиСтроки(Новый Структура("Выполняется, Выполнено", Ложь, Ложь));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Задание = НайденныеСтроки[0];
			
			Задание.Выполняется = Истина;
			Задание.Картинка = 2;
			Задание.Прогресс = ".";
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияРабочегоКаталога", ЭтотОбъект, Новый Структура("ИдентификаторЗадания", Задание.ПолучитьИдентификатор()));
			НачатьСозданиеКаталога(ОписаниеОповещения, ПолучитьИмяВременногоФайла(""));			
			
			УстановитьДоступностьЭлементовФормы();
			
		КонецЕсли;
		
	Иначе
		
		Для каждого Задание Из НайденныеСтроки Цикл
		
			// Делаем проверку, не завис ли процесс
			
			Если Задание.СчетчикРекурсии > 45 Тогда
				ОтменитьПроцессКонвертации();
				ПоказатьПредупреждение(, НСтр("ru = 'Процесс конвертации прерван. Вероятно, файл не может быть сконвертирован'"));				
			КонецЕсли;			
		
		КонецЦикла;
		
	КонецЕсли;
	
	// Ищем задания для копирования начальных файлов
	
	НайденныеСтроки = Задания.НайтиСтроки(Новый Структура("Выполняется, Этап", Истина, 1));

	Если НайденныеСтроки.Количество() > 0 Тогда

		Задание = НайденныеСтроки[0];
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИнициализацииРабочегоКаталога", ЭтотОбъект, Новый Структура("ИдентификаторЗадания", Задание.ПолучитьИдентификатор()));
		
		СвойстваЗадания = Новый Структура("Файл, Формат, ИмяФайла, Поставщик, Версия, БазовыйФормат", Задание.Файл, Задание.Формат, Задание.ИмяФайла, Задание.Поставщик, Задание.Версия, Задание.БазовыйФормат);
		ФайлыДляКопирования = ОписанияФайловДляВыгрузкиВРабочийКаталог(СвойстваЗадания, УникальныйИдентификатор, ОбщегоНазначенияСУКлиентСервер.ТипПлатформыВСтроку(ТипПлатформыНаКлиенте), РежимОтладки);
		
		НачатьПолучениеФайлов(ОписаниеОповещения, Новый Массив(ФайлыДляКопирования), Задание.РабочийКаталог, Ложь);
		
	КонецЕсли;
	
	// Ищем задания для получения информации о длительности видео
	
	НайденныеСтроки = Задания.НайтиСтроки(Новый Структура("Выполняется, Этап", Истина, 2));

	Если НайденныеСтроки.Количество() > 0 Тогда

		Задание = НайденныеСтроки[0];			
				
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПоискИнформацииОДлительности", ЭтотОбъект, Новый Структура("ИдентификаторЗадания", Задание.ПолучитьИдентификатор()));
		
		ЗапуститьПриложениеКонвертации(" -i " + ИмяОригинальногоФайла(Задание.БазовыйФормат) + " -report ", Задание.РабочийКаталог, ОписаниеОповещения);
		
	КонецЕсли;

	// Ищем задания, в которых надо найти информацию о длительности
	
	НайденныеСтроки = Задания.НайтиСтроки(Новый Структура("Выполняется, Этап", Истина, 3));

	Если НайденныеСтроки.Количество() > 0 Тогда

		Задание = НайденныеСтроки[0];	
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПоискИнформацииОДлительности", ЭтотОбъект, Новый Структура("ИдентификаторЗадания", Задание.ПолучитьИдентификатор()));	
		
		НачатьПоискФайлов(ОписаниеОповещения, Задание.РабочийКаталог, "*.log", Ложь);		
		
	КонецЕсли;		
	
	// Ищем задания для запуска конвертации
	
	НайденныеСтроки = Задания.НайтиСтроки(Новый Структура("Выполняется, Этап", Истина, 4));

	Если НайденныеСтроки.Количество() > 0 Тогда

		Задание = НайденныеСтроки[0];	
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗапускаКонвертации", ЭтотОбъект, Новый Структура("ИдентификаторЗадания", Задание.ПолучитьИдентификатор()));		
		
		ПараметрыЗапуска = " -progress progress.txt -i " + ИмяОригинальногоФайла(Задание.БазовыйФормат) ;
		
		Если Задание.Настройки <> Неопределено Тогда
			
			Если Задание.Настройки.УстановитьШиринуПоУмолчанию Тогда
			
				ШиринаПоУмолчанию = РазработкаСУЗПовтИсп.ШиринаВидеоПоУмолчанию();
				
				ПараметрыЗапуска = ПараметрыЗапуска + "  -vf scale="+  ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ШиринаПоУмолчанию) +":-2 ";
				
			КонецЕсли;
				
		КонецЕсли;
		
		Если Задание.Формат = "FLV" Тогда			
			ПараметрыЗапуска = ПараметрыЗапуска + "  -ar 44100 ";			
		КонецЕсли;
		
		ЗапуститьПриложениеКонвертации(ПараметрыЗапуска + " " + ИмяНовогоФайла(Задание.Формат), Задание.РабочийКаталог, ОписаниеОповещения);
		
		
	КонецЕсли;
	
	// Ищем задания для поиска текущего прогресса
	
	НайденныеСтроки = Задания.НайтиСтроки(Новый Структура("Выполняется, Этап", Истина, 5));

	Если НайденныеСтроки.Количество() > 0 Тогда

		Задание = НайденныеСтроки[0];	
		
		ФайлПрогресса = Новый Файл(Задание.РабочийКаталог + "progress.txt");
		
		Если ФайлПрогресса.Существует() Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьПрогрессКонвертации", ЭтотОбъект, Новый Структура("ИдентификаторЗадания", Задание.ПолучитьИдентификатор()));		
			НачатьКопированиеФайла(ОписаниеОповещения, ФайлПрогресса.ПолноеИмя, ФайлПрогресса.ПолноеИмя + "_");			
		Иначе
			Задание.СчетчикРекурсии = Задание.СчетчикРекурсии + 1;
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 2, Истина);			
		КонецЕсли;		
		
	КонецЕсли;
	
	// Ищем задания для сохранения результата в базу
	
	НайденныеСтроки = Задания.НайтиСтроки(Новый Структура("Выполняется, Этап", Истина, 6));

	Если НайденныеСтроки.Количество() > 0 Тогда

		Задание = НайденныеСтроки[0];	

		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияНовогоФайлаВХранилище", ЭтотОбъект, Новый Структура("ИдентификаторЗадания", Задание.ПолучитьИдентификатор()));
		
		Попытка
			НачатьПомещениеФайла(ОписаниеОповещения,,  Задание.РабочийКаталог + ИмяНовогоФайла(Задание.Формат), Ложь, УникальныйИдентификатор);
		Исключение
			Задание.СчетчикРекурсии = Задание.СчетчикРекурсии + 1;
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 2, Истина);
		КонецПопытки;
		
	КонецЕсли;
	
	// Ищем завершенные задания
	
	НайденныеСтроки = Задания.НайтиСтроки(Новый Структура("Выполняется, Этап", Истина, 7));

	Если НайденныеСтроки.Количество() > 0 Тогда

		Задание = НайденныеСтроки[0];		
		
		Задание.Выполняется = Ложь;
		Задание.Выполнено = Истина;		
		Задание.Картинка = 1;
		
		СформироватьТаблицуФорматов();
		
		УстановитьДоступностьЭлементовФормы();
		
		Попытка
			УдалитьФайлы(Задание.РабочийКаталог); // Удаляем рабочий каталог (синхронный метод)
		Исключение
		КонецПопытки;
		
		Задание.РабочийКаталог = "";
		
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 0.1, Истина);
		
		Оповестить("ВыполненаКонвертацияВидео", Параметры.Файл, ЭтотОбъект);
		
		ОбновитьПовторноИспользуемыеЗначения(); // Так как доступные форматы кэшируются
		
	КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияРабочегоКаталога(ИмяКаталога, ДополнительныеПараметры) Экспорт
	
	Задание = Задания.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторЗадания);
	Задание.РабочийКаталог = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяКаталога);
	Задание.Этап = 1;
	Задание.Прогресс = "..";
	Задание.СчетчикРекурсии = 0;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИнициализацииРабочегоКаталога(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Задание = Задания.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторЗадания);
	Задание.Этап = 2;	
	Задание.Прогресс = "...";
	Задание.СчетчикРекурсии = 0;

	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 0.1, Истина);
	
КонецПроцедуры	

&НаКлиенте
Процедура НачатьПоискИнформацииОДлительности(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Задание = Задания.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторЗадания);
	
	Задание.Этап = 3;	
	Задание.Прогресс = "....";
	Задание.СчетчикРекурсии = 0;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 2, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ПоискИнформацииОДлительности(НайденныеФайлы, ДополнительныеПараметры) Экспорт

	Задание = Задания.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторЗадания);	
	
	Если НайденныеФайлы.Количество() = 0 Тогда
		Задание.СчетчикРекурсии = Задание.СчетчикРекурсии + 1; 
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 1, Истина);
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;			
	
	Попытка
		ТекстовыйДокумент.Прочитать(НайденныеФайлы[0].ПолноеИмя);
	Исключение
		Задание.СчетчикРекурсии = Задание.СчетчикРекурсии + 1; 
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 1, Истина);		
		Возврат;
	КонецПопытки;	
	
	ТекстЛогФайла = ТекстовыйДокумент.ПолучитьТекст();
	
	ПозицияDuration = Найти(ТекстЛогФайла, "Duration:");
	
	Если ПозицияDuration < 1 Тогда
		Задание.СчетчикРекурсии = Задание.СчетчикРекурсии + 1; 
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 1, Истина);		
		Возврат;
	КонецЕсли;
	
	ПраваяЧастьЛогФайла = Сред(ТекстЛогФайла, ПозицияDuration + СтрДлина("Duration:"));
	
	ПозицияКонцаDuration = Найти(ПраваяЧастьЛогФайла, ",");
	
	ТекстDuration = СокрЛП(Сред(ПраваяЧастьЛогФайла, 1, ПозицияКонцаDuration-1));
	
	DurationМассив = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ТекстDuration, ":");
	
	DurationВСекундах = 0;
	
	Попытка
		DurationВСекундах = Число(DurationМассив[0])*60*60 + Число(DurationМассив[1])*60 + Число(DurationМассив[2]);
	Исключение
		Задание.СчетчикРекурсии = Задание.СчетчикРекурсии + 1; 
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 1, Истина);		
		Возврат;
	КонецПопытки;
	
	Если DurationВСекундах = 0 Тогда
		Задание.СчетчикРекурсии = Задание.СчетчикРекурсии + 1; 
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 1, Истина);		
		Возврат;		
	КонецЕсли;
	
	Задание.Длительность = DurationВСекундах;	
	Задание.Этап = 4;
	Задание.Прогресс = ".....";
	Задание.СчетчикРекурсии = 0;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 0.1, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапускаКонвертации(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Задание = Задания.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторЗадания);	

	Задание.Этап = 5;	
	Задание.Прогресс = "......";
	Задание.СчетчикРекурсии = 0;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрогрессКонвертации(СкопированныйФайл, ДополнительныеПараметры) Экспорт
	
	Задание = Задания.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторЗадания);	
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	ТекстовыйДокумент.Прочитать(СкопированныйФайл);
	
	КоличествоСтрок = ТекстовыйДокумент.КоличествоСтрок();
	
	// Ищем прогресс в числах
	
	НомерСтроки = КоличествоСтрок;
	ТекущаяПозицияВСекундах = 0;
	
	Пока НомерСтроки > 0 Цикл
		
		ТекущаяСтрока = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки);
		
		ПозицияПеременной = Найти(ТекущаяСтрока, "out_time_ms=");
		
		Если ПозицияПеременной = 1 Тогда
			
			ТекущаяПозицияВСекундах = Число(СокрЛП(Сред(ТекущаяСтрока, СтрДлина("out_time_ms=")+1))) / 1000000;
			
			Прервать;
			
		КонецЕсли;			
		
		НомерСтроки = НомерСтроки - 1;
		
	КонецЦикла;
	
	Если Задание.Длительность = 0 Тогда
		ПрогрессЧисло = 0;
	Иначе
		ПрогрессЧисло = Окр((ТекущаяПозицияВСекундах / Задание.Длительность)*100, 0);
	КонецЕсли;
	
	Если ПрогрессЧисло > 100 Тогда
		ПрогрессЧисло = 100;
	КонецЕсли;
	
	НовыйПрогресс = Строка(ПрогрессЧисло) + "%";
	
	Если Задание.Прогресс = НовыйПрогресс Тогда
		Задание.СчетчикРекурсии = Задание.СчетчикРекурсии + 1;
	Иначе
		Задание.СчетчикРекурсии = 0;
	КонецЕсли;
	
	Задание.Прогресс = НовыйПрогресс;
	
	// Ищем прогресс по факту
	
	НомерСтроки = КоличествоСтрок;
	ЗначениеПрогрессаСтрока = "";
	
	Пока НомерСтроки > 0 Цикл
		
		ТекущаяСтрока = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки);
		
		ПозицияПеременной = Найти(ТекущаяСтрока, "progress=");
		
		Если ПозицияПеременной = 1 Тогда
			
			ЗначениеПрогрессаСтрока = СокрЛП(Сред(ТекущаяСтрока, СтрДлина("progress=")+1));
			
			Прервать;
			
		КонецЕсли;			
		
		НомерСтроки = НомерСтроки - 1;
		
	КонецЦикла;
	
	Если ЗначениеПрогрессаСтрока = "end" Тогда
		Задание.Этап = 6;
		Задание.СчетчикРекурсии = 0;
		Задание.Прогресс = "100%";
	КонецЕсли;
	
	// Завершаем	
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 3, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияНовогоФайлаВХранилище(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка сохранения файла: %1'");
	КонецЕсли;
	
	Задание = Задания.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторЗадания);
	
	СохранитьВБазеНовыйФайл(Адрес, Задание.Формат, Задание.Файл, Задание.Поставщик, Задание.Версия);
	
	Задание.Этап = 7;	
	Задание.СчетчикРекурсии = 0;

	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеКонвертации", 0.1, Истина);	
	
КонецПроцедуры

// КОНВЕРТАЦИЯ ВСПОМОГАТЕЛЬНОЕ

&НаКлиенте
Процедура ЗапуститьПриложениеКонвертации(ПараметрыКонвертации, РабочийКаталог, ОписаниеОповещения)
	
	ПрограммаКонвертации = ОписаниеПрограммыКонвертации(ТипПлатформыНаКлиенте, РежимОтладки);
	
	Если (ТипПлатформыНаКлиенте = ТипПлатформы.Windows_x86) ИЛИ (ТипПлатформыНаКлиенте = ТипПлатформы.Windows_x86_64) Тогда		
			
		WshShell = Новый COMОбъект("WScript.Shell");
		WshShell.CurrentDirectory = РабочийКаталог;
		WshShell.Run(РабочийКаталог + ПрограммаКонвертации.ИмяФайла + ПараметрыКонвертации, ?(ПрограммаКонвертации.РежимОтладки, 1, 0), 0);
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		
	Иначе
		
		Если ОбщегоНазначенияКлиентСервер.ЭтоLinuxКлиент() Тогда
			ПараметрыЗапускаПрограммы = ПараметрыЗапускаПрограммы();
			ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
			ЗапуститьПрограмму("sudo chmod +x " + РабочийКаталог + ПрограммаКонвертации.ИмяФайла, ПараметрыЗапускаПрограммы);
		КонецЕсли;		
		
		НачатьЗапускПриложения(ОписаниеОповещения, РабочийКаталог + ПрограммаКонвертации.ИмяФайла + ПараметрыКонвертации, РабочийКаталог, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьПроцессКонвертации()
	
	#Если НЕ ВебКлиент Тогда
		
	ВыполняетсяКонвертация = Ложь;
		
	Для каждого Задание Из Задания Цикл
		
		Если Задание.Выполняется Тогда
			
			Если (ТипПлатформыНаКлиенте = ТипПлатформы.Windows_x86) ИЛИ (ТипПлатформыНаКлиенте = ТипПлатформы.Windows_x86_64) Тогда
				
				Попытка
					WshShell = Новый COMОбъект("WScript.Shell");
					WshShell.CurrentDirectory = Задание.РабочийКаталог;					
					WshShell.Run("taskkill /IM ffmpeg.exe /F", 0, 0);
				Исключение
					ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("ru = 'Конвертация видео'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), "Ошибка", "ОтменитьПроцессКонвертации(): " + ИнформацияОбОшибке() + Символы.ПС + ОписаниеОшибки());
				КонецПопытки;				
					
			КонецЕсли;
			
			Задание.СчетчикРекурсии = 0;
			Задание.Этап = 0;
			Задание.Длительность = 0;
			Задание.Картинка = 3;
			Задание.Прогресс = "";
			Задание.Выполняется = Ложь;					
			
		КонецЕсли;			
		
	КонецЦикла;		
	
	УстановитьДоступностьЭлементовФормы();
	
	#КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыЗапускаПрограммы()
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущийКаталог", "");
	Параметры.Вставить("ДождатьсяЗавершения", Ложь);
	Параметры.Вставить("ПолучитьПотокВывода", Ложь);
	Параметры.Вставить("ПолучитьПотокОшибок", Ложь);
	Параметры.Вставить("ВыполнитьСНаивысшимиПравами", Ложь); // для переводчиков: RunWithElevatedPermissions.
	
	Возврат Параметры;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьПрограмму(Знач СтрокаКоманды, ПараметрыЗапускаПрограммы = Неопределено) Экспорт 
	
#Если ВебКлиент Тогда
	ВызватьИсключение НСтр("ru = 'Запуск программ недоступен в веб-клиенте'");
#Иначе
	
	
	Если ПараметрыЗапускаПрограммы = Неопределено Тогда 
		ПараметрыЗапускаПрограммы = ПараметрыЗапускаПрограммы();
	КонецЕсли;
	
	ТекущийКаталог              = ПараметрыЗапускаПрограммы.ТекущийКаталог;
	ДождатьсяЗавершения         = ПараметрыЗапускаПрограммы.ДождатьсяЗавершения;
	ПолучитьПотокВывода         = ПараметрыЗапускаПрограммы.ПолучитьПотокВывода;
	ПолучитьПотокОшибок         = ПараметрыЗапускаПрограммы.ПолучитьПотокОшибок;
	ВыполнитьСНаивысшимиПравами = ПараметрыЗапускаПрограммы.ВыполнитьСНаивысшимиПравами;
	
	Если ВыполнитьСНаивысшимиПравами Тогда 
#Если ВнешнееСоединение Тогда
		ВызватьИсключение 
			НСтр("ru = 'Недопустимое значение параметра ПараметрыЗапускаПрограммы.ВыполнитьСНаивысшимиПравами.
			           |Повешение привилегий системы не доступно из внешнего соединения.'");
#КонецЕсли
		
#Если Сервер Тогда
		ВызватьИсключение 
			НСтр("ru = 'Недопустимое значение параметра ПараметрыЗапускаПрограммы.ВыполнитьСНаивысшимиПравами.
			           |Повешение привилегий системы не доступно на сервере.'");
#КонецЕсли
		
	КонецЕсли;
	
	Если ДождатьсяЗавершения Тогда 
		
		Если ПолучитьПотокВывода Тогда 
			ФайлПотокаВывода = ПолучитьИмяВременногоФайла("stdout.tmp");
			СтрокаКоманды = СтрокаКоманды + " > """ + ФайлПотокаВывода + """";
		КонецЕсли;
		
		Если ПолучитьПотокОшибок Тогда 
			ФайлПотокаОшибок = ПолучитьИмяВременногоФайла("stderr.tmp");
			СтрокаКоманды = СтрокаКоманды + " 2>""" + ФайлПотокаОшибок + """";
		КонецЕсли;
		
	КонецЕсли;
	
	КодВозврата = Неопределено;
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	Если (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86) 
		Или (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64) Тогда
		
		// Из-за запуска через shell перенаправление каталога требуется сделать командой.
		Если Не ПустаяСтрока(ТекущийКаталог) Тогда 
			СтрокаКоманды = "cd """ + ТекущийКаталог + """ && " + СтрокаКоманды;
		КонецЕсли;
		
		// Выполняется запуск через cmd.exe (для перенаправления stdout и stderr).
		СтрокаКоманды = "cmd /S /C "" " + СтрокаКоманды + " """;
		
#Если Сервер Тогда
		Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
			// В файловой информационной базе показывать окно консоли не следует и в серверном контексте.
			Оболочка = Новый COMОбъект("Wscript.Shell");
			// Run запускает новый процесс, не являющийся дочерним текущего процесса (в отличии от Exec).
			КодВозврата = Оболочка.Run(СтрокаКоманды, 0, ДождатьсяЗавершения);
			Оболочка = Неопределено;
		Иначе 
			ЗапуститьПриложение(СтрокаКоманды,, ДождатьсяЗавершения, КодВозврата);
		КонецЕсли;
#Иначе
		Если ВыполнитьСНаивысшимиПравами Тогда
			
			Если ДождатьсяЗавершения Тогда
				ВызватьИсключение 
					НСтр("ru = 'Недопустимо одновременно устанавливать параметры 
					           | - ПараметрыЗапускаПрограммы.ДождатьсяЗавершения и
					           | - ПараметрыЗапускаПрограммы.ВыполнитьСНаивысшимиПравами:
					           |Операционная система не позволяет отслеживать от имени пользователя процессы,
					           |запущенные администратором.'");
			КонецЕсли;
			
			// После начала исполнения файла команды отследить статус процесса будет невозможно,
			// Потому удалять batch файл следует последней строкой команды в самом batch файле.
			// Асинхронно удалять нельзя, иначе может наступить коллизия, 
			// когда идет попытка удаления, а запуск еще не состоялся.
			
			ФайлКоманды = ПолучитьИмяВременногоФайла("runas.bat");
			ЗаписьКоманды = Новый ЗаписьТекста(ФайлКоманды, КодировкаТекста.OEM);
			ЗаписьКоманды.ЗаписатьСтроку(СтрокаКоманды);
			ЗаписьКоманды.ЗаписатьСтроку("del /f /q """ + ФайлКоманды + """");
			ЗаписьКоманды.Закрыть();
			
			Оболочка = Новый COMОбъект("Shell.Application");
			// Запуск с передачей глагола действия - повышения привилегий.
			Оболочка.ShellExecute("cmd", "/c """ + ФайлКоманды + """",, "runas", 0);
			Оболочка = Неопределено;
			
		Иначе 
			Оболочка = Новый COMОбъект("Wscript.Shell");
			// Run запускает новый процесс, не являющийся дочерним текущего процесса (в отличии от Exec).
			КодВозврата = Оболочка.Run(СтрокаКоманды, 0, ДождатьсяЗавершения);
			Оболочка = Неопределено;
		КонецЕсли;
#КонецЕсли
		
	ИначеЕсли (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86) 
		Или (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64) Тогда
		
		Если ВыполнитьСНаивысшимиПравами Тогда
			
			ШаблонКоманды = "pkexec env DISPLAY=[DISPLAY] XAUTHORITY=[XAUTHORITY] [СтрокаКоманды]";
			
			ПараметрыШаблона = Новый Структура;
			ПараметрыШаблона.Вставить("СтрокаКоманды", СтрокаКоманды);
			
			ПараметрыЗапускаПодпрограммы = ПараметрыЗапускаПрограммы();
			ПараметрыЗапускаПодпрограммы.ДождатьсяЗавершения = Истина;
			ПараметрыЗапускаПодпрограммы.ПолучитьПотокВывода = Истина;;
			
			Результат = ЗапуститьПрограмму("echo $DISPLAY", ПараметрыЗапускаПодпрограммы);
			ПараметрыШаблона.Вставить("DISPLAY", Результат.ПотокВывода);
			
			Результат = ЗапуститьПрограмму("echo $XAUTHORITY", ПараметрыЗапускаПодпрограммы);
			ПараметрыШаблона.Вставить("XAUTHORITY", Результат.ПотокВывода);
			
			СтрокаКоманды = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонКоманды, ПараметрыШаблона);
			ДождатьсяЗавершения = Истина;
			
		КонецЕсли;
		
		ЗапуститьПриложение(СтрокаКоманды, ТекущийКаталог, ДождатьсяЗавершения, КодВозврата);
		
	Иначе
		
		// Для MacOS просто запускаем команду.
		// Параметр ПараметрыЗапускаПрограммы.ВыполнитьСНаивысшимиПравами игнорируется.
		ЗапуститьПриложение(СтрокаКоманды, ТекущийКаталог, ДождатьсяЗавершения, КодВозврата);
		
	КонецЕсли;
	
	// Переопределение возвращенного оболочной значения.
	Если КодВозврата = Неопределено Тогда 
		КодВозврата = 0;
	КонецЕсли;
	
	ПотокВывода = "";
	ПотокОшибок = "";
	
	Если ДождатьсяЗавершения Тогда 
		
		Если ПолучитьПотокВывода Тогда
			
			ЧтениеПотокаВывода = Новый ЧтениеТекста(ФайлПотокаВывода, КодировкаСтандартныхПотоков()); 
			ПотокВывода = ЧтениеПотокаВывода.Прочитать();
			ЧтениеПотокаВывода.Закрыть();
			
			УдалитьВременныйФайл(ФайлПотокаВывода);
			
			Если ПотокВывода = Неопределено Тогда 
				ПотокВывода = "";
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПолучитьПотокОшибок Тогда 
			
			ЧтениеПотокаОшибок = Новый ЧтениеТекста(ФайлПотокаОшибок, КодировкаСтандартныхПотоков());
			ПотокОшибок = ЧтениеПотокаОшибок.Прочитать();
			ЧтениеПотокаОшибок.Закрыть();
			
			УдалитьВременныйФайл(ФайлПотокаОшибок);
			
			Если ПотокОшибок = Неопределено Тогда 
				ПотокОшибок = "";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодВозврата", КодВозврата);
	Результат.Вставить("ПотокВывода", ПотокВывода);
	Результат.Вставить("ПотокОшибок", ПотокОшибок);
	
	Возврат Результат;
	
#КонецЕсли
	
КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьВременныйФайл(ПолноеИмяФайла)
	
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		УдалитьФайлы(ПолноеИмяФайла);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КодировкаСтандартныхПотоков()
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	Если (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86) 
		Или (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64) Тогда
		
		Кодировка = КодировкаТекста.OEM;
	Иначе
		Кодировка = КодировкаТекста.Системная;
	КонецЕсли;
	
	Возврат Кодировка;
	
КонецФункции


&НаСервереБезКонтекста
Процедура СохранитьВБазеНовыйФайл(АдресФайла, Формат, Файл, Поставщик, Версия) 
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	
	РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(Файл, ДвоичныеДанные, Формат, "ДвоичныеДанные", Поставщик, Версия);
	
	РесурсФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Файл, "Владелец");
	
	РесурсФайлаОбъект = РесурсФайла.ПолучитьОбъект();
	РесурсФайлаОбъект.Записать(); // Обновляем дату ресурса
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписанияФайловДляВыгрузкиВРабочийКаталог(Задание, УникальныйИдентификатор, ТипПлатформыСтрока, РежимОтладки)
	
	ТипПлатформыКлиента = ОбщегоНазначенияСУКлиентСервер.СтрокаВТипПлатформы(ТипПлатформыСтрока);
	ОписанияФайлов = Новый Массив;
	
	// Оригинальный файл видео
	
	ИмяОригинальногоФайла = ИмяОригинальногоФайла(Задание.БазовыйФормат);
	
	АдресФайлаОригинала = РегистрыСведений.ДанныеФайлыСУЗ.АдресХраненияДвоичныхДанных(Задание.Файл, Задание.Поставщик, Задание.Версия, "ДвоичныеДанные", УникальныйИдентификатор); 
	ОписанияФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяОригинальногоФайла, АдресФайлаОригинала));
	
	// Программа конвертации
	
	ПрограммаКонвертации = ОписаниеПрограммыКонвертации(ТипПлатформыКлиента, РежимОтладки);
	
	Если ПрограммаКонвертации <> Неопределено Тогда
		
		ДвоичныеДанныеПрограммы = РазработкаСУЗ.ДвоичныеДанныеПрограммы(ПрограммаКонвертации.Код);
		ХранениеДанныхПрограммы = ПоместитьВоВременноеХранилище(ДвоичныеДанныеПрограммы, УникальныйИдентификатор);
		
		ОписанияФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(ПрограммаКонвертации.ИмяФайла, ХранениеДанныхПрограммы));		
		
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ОписанияФайлов);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОригинальногоФайла(БазовыйФормат)
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением("original", НРег(БазовыйФормат))
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяНовогоФайла(Формат)
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением("new", НРег(Формат))
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеПрограммыКонвертации(ТипПлатформыКлиента, РежимОтладки)
	
	ИмяПрограммыКонвертации = "ffmpeg";
	
	Если (ТипПлатформыКлиента = ТипПлатформы.Windows_x86) ИЛИ (ТипПлатформыКлиента = ТипПлатформы.Windows_x86_64) Тогда
		
		СвойстваПрограммы = ШаблонСвойствПрограммыДляКонвертации();
		СвойстваПрограммы.Код = "КонвертерВидеоWindows";
		СвойстваПрограммы.ИмяФайла = ИмяПрограммыКонвертации + ".exe";
		СвойстваПрограммы.РежимОтладки = РежимОтладки;
		
		Возврат СвойстваПрограммы;
		
	КонецЕсли;
	
	Если (ТипПлатформыКлиента = ТипПлатформы.Linux_x86) ИЛИ (ТипПлатформыКлиента = ТипПлатформы.Linux_x86_64) Тогда
		
		СвойстваПрограммы = ШаблонСвойствПрограммыДляКонвертации();
		СвойстваПрограммы.Код = "КонвертерВидеоLinux";
		СвойстваПрограммы.ИмяФайла = ИмяПрограммыКонвертации;
		СвойстваПрограммы.РежимОтладки = РежимОтладки;
		
		Возврат СвойстваПрограммы;
		
	КонецЕсли;
	
	Если (ТипПлатформыКлиента = ТипПлатформы.MacOS_x86) ИЛИ (ТипПлатформыКлиента = ТипПлатформы.MacOS_x86_64) Тогда
		
		СвойстваПрограммы = ШаблонСвойствПрограммыДляКонвертации();
		СвойстваПрограммы.Код = "КонвертерВидеоMac";
		СвойстваПрограммы.ИмяФайла = ИмяПрограммыКонвертации;
		СвойстваПрограммы.РежимОтладки = РежимОтладки;
		
		Возврат СвойстваПрограммы;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонСвойствПрограммыДляКонвертации()
	Возврат Новый Структура("Код, ИмяФайла, РежимОтладки", "", "", Ложь);
КонецФункции



// ФАЙЛЫ

&НаСервере
Процедура СформироватьТаблицуФорматов()
	
	// Заполняем таблицу файлов
	
	Если ЗначениеЗаполнено(Параметры.Файл) Тогда		
		ФорматыВидеоФайлов = Справочники.ФайлыСУЗ.ФорматыВидеоФайлов(Параметры.Файл, Параметры.Версия, Параметры.Поставщик);		
	Иначе
		ФорматыВидеоФайлов = Справочники.ФайлыСУЗ.ФорматыВидеоФайлов();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ФорматыВидеоФайлов, "ТаблицаФайлов");			

КонецПроцедуры

// ОБЩЕЕ

&НаСервере
Функция УстановитьДоступностьЭлементовФормы()	
	
	ЕстьАктивноеЗадание = Ложь;
	ЕстьНовоеЗадание = Ложь;
	
	Для каждого Строка Из Задания Цикл
	
		Если Строка.Выполняется Тогда
			ЕстьАктивноеЗадание = Истина;
		КонецЕсли;
		
		Если НЕ Строка.Выполняется И НЕ Строка.Выполнено Тогда
			ЕстьНовоеЗадание = Истина;
		КонецЕсли;		
		
	КонецЦикла;
	
	Элементы.УдалитьЗадания.Доступность = ?(Задания.Количество() > 0, Истина, Ложь);
	Элементы.КомандаНачатьКонвертацию.Доступность = ?(НЕ ЕстьАктивноеЗадание И ЕстьНовоеЗадание, Истина, Ложь);
	Элементы.ДекорацияПрогресс.Видимость = ЕстьАктивноеЗадание;
	Элементы.ГруппаКомандыКонвертации.Доступность = ?(ТаблицаФайлов.Количество() > 0, Истина, Ложь);
	Элементы.КомандаУдалитьФорматы.Доступность = ?(ТаблицаФайлов.Количество() > 0, Истина, Ложь);
	Элементы.КомандаОтменитьКонвертацию.Доступность = ЕстьАктивноеЗадание;	
	
	Если ЗначениеЗаполнено(Параметры.Файл) И ТаблицаФайлов.Количество() > 0 Тогда
		
		СвойстваФайла = ТаблицаФайлов[0];
		
		Элементы.ДекорацияНетФорматаFLV.Видимость = НЕ СвойстваФайла.FLV;
		Элементы.ДекорацияНетФорматаMP4.Видимость = НЕ СвойстваФайла.MP4;
		Элементы.ДекорацияНетФорматаWEBM.Видимость = НЕ СвойстваФайла.WEBM;
		
		Элементы.ДекорацияЕстьФорматFLV.Видимость = СвойстваФайла.FLV;
		Элементы.ДекорацияЕстьФорматMP4.Видимость = СвойстваФайла.MP4;
		Элементы.ДекорацияЕстьФорматWEBM.Видимость = СвойстваФайла.WEBM;
		
		
		Элементы.СформироватьFLV.Доступность = ?(НЕ СвойстваФайла.FLV, Истина, Ложь);
		Элементы.СформироватьMP4.Доступность = ?(НЕ СвойстваФайла.MP4, Истина, Ложь);
		Элементы.СформироватьWEBM.Доступность = ?(НЕ СвойстваФайла.WEBM, Истина, Ложь);
		
		Элементы.УдалитьFLV.Доступность = ?(СвойстваФайла.FLV, Истина, Ложь);
		Элементы.УдалитьMP4.Доступность = ?(СвойстваФайла.MP4, Истина, Ложь);
		Элементы.УдалитьWEBM.Доступность = ?(СвойстваФайла.WEBM, Истина, Ложь);
		
	КонецЕсли;
	
КонецФункции


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Файлы

&НаКлиенте
Процедура ТаблицаФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ТекущаяСтрока = ТаблицаФайлов.НайтиПоИдентификатору(ВыбраннаяСтрока);		
	
	ОткрытьФорму("Справочник.ФайлыСУЗ.Форма.ФормаКонвертерВидео", Новый Структура("Файл, Версия, Поставщик", ТекущаяСтрока.Файл, ТекущаяСтрока.Версия, ТекущаяСтрока.Поставщик), ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадания

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Задания

&НаКлиенте
Процедура ЗаданияПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Массив")
		ИЛИ  ПараметрыПеретаскивания.Значение.Количество() = 0
		ИЛИ ТипЗнч(ПараметрыПеретаскивания.Значение[0]) <> Тип("ДанныеФормыЭлементКоллекции")
		ИЛИ НЕ ПараметрыПеретаскивания.Значение[0].Свойство("Файл") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если  ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена
		ИЛИ ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Массив")
		ИЛИ ПараметрыПеретаскивания.Значение.Количество() = 0
		ИЛИ ТипЗнч(ПараметрыПеретаскивания.Значение[0]) <> Тип("ДанныеФормыЭлементКоллекции")
		ИЛИ НЕ ПараметрыПеретаскивания.Значение[0].Свойство("Файл") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СформироватьЗадания(, ПараметрыПеретаскивания.Значение);	
	
КонецПроцедуры

#КонецОбласти
